* Tasks
** DONE NN HW5,7,8                                             :nn:hw:
   DEADLINE: <2013-10-01 Tue>
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2013-10-01 Tue 11:24]
   :END:
   [2013-09-29 Sun]
** TODO NBN Software                                        :code:cpp:
   SCHEDULED: <2013-09-30 Mon>
   [2013-09-29 Sun]
** KILL bootstrap-select			      :code:js:github:
   SCHEDULED: <2013-10-30 Wed>
   :LOGBOOK:
   - State "KILL"       from "TODO"       [2013-12-17 Tue 20:44]
   :END:
   [2013-10-30 Wed]
** DONE Term Paper					    :comp6700:
   SCHEDULED: <2013-11-04 Mon> DEADLINE: <2013-12-06 Fri>
   :LOGBOOK:
   - State "DONE"       from ""           [2013-12-17 Tue 20:44]
   :END:
   [2013-10-30 Wed]
** KILL hmm                                                 :research:
   DEADLINE: <2013-12-04 Wed> SCHEDULED: <2013-10-30 Wed>
   :LOGBOOK:
   - State "KILL"       from "TODO"       [2013-11-13 Wed 10:32]
   :END:
   [2013-10-30 Wed]
** TODO simulation                                          :research:
   DEADLINE: <2013-11-29 Fri> SCHEDULED: <2013-10-30 Wed>
   [2013-10-30 Wed]


* Someday
  :PROPERTIES:
  :CATEGORY: idea
  :END:
** The Croods                                                  :movie:
[2013-08-04 Sun]
瘋狂原始人/古魯家族
http://www.imdb.com/title/tt0481499/

** Despicable Me                                               :movie:
[2013-08-04 Sun]
神偷奶爸
http://www.imdb.com/title/tt1323594/
** 繪制山海經地圖                                        :js:cpp:code:
   [2013-08-04 Sun]
** supercover and polygon raster demo                    :js:cpp:code:
   [2013-08-04 Sun]
** rainbow delimiter mode                                :elisp:emacs:
    [2013-08-09 Fri]
    fix mismatch bug for C/C++
** God must be crazy                                           :movie:
   [2013-08-13 Tue]
   https://www.youtube.com/watch?v=mI-WJtGC8dI
** 大劍                                                            :movie:
   [2013-08-15 Thu]
** 进击的巨人                                                            :movie:
   [2013-08-15 Thu]
** snakes game                                             :game:code:
   [2013-08-16 Fri]

   code a automatic snakes game solver, i.e., the computer finds the
   path automactially.
   1. one target
   2. multiple targets
** hide-region                                                 :emacs:
   [2013-09-04 Wed]
   modify hide region, add line count, toggle function
** 降世神通                                                    :video:
   [2013-10-27 Sun]



* Habits
   :PROPERTIES:
   :LOGGING:  DONE(!) logrepeat
   :END:
*** TODO Excercise
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2014-01-13 Mon 19:15]
   CLOCK: [2014-01-13 Mon 18:44]--[2014-01-13 Mon 19:15] =>  0:31
   - State "DONE"       from "TODO"       [2014-01-12 Sun 18:53]
   CLOCK: [2014-01-12 Sun 18:18]--[2014-01-12 Sun 18:53] =>  0:35
   - State "DONE"       from "TODO"       [2014-01-11 Sat 18:30]
   CLOCK: [2014-01-11 Sat 18:08]--[2014-01-11 Sat 18:30] =>  0:22
   - State "DONE"       from "TODO"       [2014-01-09 Thu 18:57]
   CLOCK: [2014-01-09 Thu 18:17]--[2014-01-09 Thu 18:57] =>  0:40
   - State "DONE"       from "TODO"       [2014-01-08 Wed 18:16]
   CLOCK: [2014-01-08 Wed 17:45]--[2014-01-08 Wed 18:16] =>  0:31
   - State "DONE"       from "TODO"       [2014-01-06 Mon 22:00]
   CLOCK: [2014-01-06 Mon 21:30]--[2014-01-06 Mon 22:00] =>  0:30
   - State "DONE"       from "TODO"       [2014-01-05 Sun 18:38]
   CLOCK: [2014-01-05 Sun 18:05]--[2014-01-05 Sun 18:38] =>  0:33
   - State "DONE"       from "TODO"       [2014-01-04 Sat 17:57]
   CLOCK: [2014-01-04 Sat 17:22]--[2014-01-04 Sat 17:57] =>  0:35
   - State "DONE"       from "TODO"       [2014-01-02 Thu 18:01]
   CLOCK: [2014-01-02 Thu 17:30]--[2014-01-02 Thu 18:01] =>  0:31
   - State "DONE"       from "TODO"       [2014-01-01 Wed 18:12]
   CLOCK: [2014-01-01 Wed 17:43]--[2014-01-01 Wed 18:12] =>  0:29
   - State "DONE"       from "TODO"       [2013-12-30 Mon 17:44]
   CLOCK: [2013-12-30 Mon 17:17]--[2013-12-30 Mon 17:44] =>  0:27
   - State "DONE"       from "TODO"       [2013-12-29 Sun 17:38]
   CLOCK: [2013-12-29 Sun 17:02]--[2013-12-29 Sun 17:38] =>  0:36
   - State "DONE"       from "TODO"       [2013-12-28 Sat 19:00]
   CLOCK: [2013-12-28 Sat 18:32]--[2013-12-28 Sat 19:00] =>  0:28
   - State "DONE"       from "TODO"       [2013-12-27 Fri 18:38]
   CLOCK: [2013-12-27 Fri 18:00]--[2013-12-27 Fri 18:38] =>  0:38
   - State "DONE"       from "TODO"       [2013-12-26 Thu 19:01]
   CLOCK: [2013-12-26 Thu 18:30]--[2013-12-26 Thu 19:01] =>  0:31
   - State "DONE"       from "TODO"       [2013-12-25 Wed 19:27]
   CLOCK: [2013-12-25 Wed 18:56]--[2013-12-25 Wed 19:27] =>  0:31
   - State "DONE"       from "TODO"       [2013-12-23 Mon 17:36]
   CLOCK: [2013-12-23 Mon 17:01]--[2013-12-23 Mon 17:36] =>  0:35
   - State "DONE"       from "TODO"       [2013-12-22 Sun 19:22]
   CLOCK: [2013-12-22 Sun 18:55]--[2013-12-22 Sun 19:22] =>  0:27
   - State "DONE"       from "TODO"       [2013-12-19 Thu 17:49]
   CLOCK: [2013-12-19 Thu 17:20]--[2013-12-19 Thu 17:49] =>  0:29
   - State "DONE"       from "TODO"       [2013-11-27 Wed 19:20]
   CLOCK: [2013-11-27 Wed 18:43]--[2013-11-27 Wed 19:20] =>  0:37
   - State "DONE"       from "TODO"       [2013-11-26 Tue 18:14]
   CLOCK: [2013-11-26 Tue 18:00]--[2013-11-26 Tue 18:14] =>  0:14
   - State "DONE"       from "TODO"       [2013-11-25 Mon 18:57]
   CLOCK: [2013-11-25 Mon 18:29]--[2013-11-25 Mon 18:57] =>  0:28
   - State "DONE"       from "TODO"       [2013-11-23 Sat 19:04]
   CLOCK: [2013-11-23 Sat 18:37]--[2013-11-23 Sat 19:04] =>  0:27
   - State "DONE"       from "TODO"       [2013-11-21 Thu 18:43]
   CLOCK: [2013-11-21 Thu 18:14]--[2013-11-21 Thu 18:43] =>  0:29
   - State "DONE"       from "TODO"       [2013-11-20 Wed 18:08]
   CLOCK: [2013-11-20 Wed 17:42]--[2013-11-20 Wed 18:08] =>  0:26
   - State "DONE"       from "TODO"       [2013-11-19 Tue 18:01]
   CLOCK: [2013-11-19 Tue 17:36]--[2013-11-19 Tue 18:01] =>  0:25
   - State "DONE"       from "TODO"       [2013-11-18 Mon 18:47]
   CLOCK: [2013-11-18 Mon 18:20]--[2013-11-18 Mon 18:47] =>  0:27
   - State "DONE"       from "TODO"       [2013-11-17 Sun 17:51]
   CLOCK: [2013-11-17 Sun 17:25]--[2013-11-17 Sun 17:51] =>  0:26
   - State "DONE"       from "TODO"       [2013-11-16 Sat 18:21]
   CLOCK: [2013-11-16 Sat 17:56]--[2013-11-16 Sat 18:21] =>  0:25
   - State "DONE"       from "TODO"       [2013-11-14 Thu 18:38]
   CLOCK: [2013-11-14 Thu 18:08]--[2013-11-14 Thu 18:38] =>  0:30
   - State "DONE"       from "TODO"       [2013-11-13 Wed 17:59]
   CLOCK: [2013-11-13 Wed 17:36]--[2013-11-13 Wed 17:59] =>  0:23
   - State "DONE"       from "TODO"       [2013-11-12 Tue 18:42]
   CLOCK: [2013-11-12 Tue 18:09]--[2013-11-12 Tue 18:42] =>  0:33
   - State "DONE"       from "TODO"       [2013-11-11 Mon 18:25]
   CLOCK: [2013-11-11 Mon 17:53]--[2013-11-11 Mon 18:25] =>  0:32
   - State "DONE"       from "TODO"       [2013-11-10 Sun 18:31]
   CLOCK: [2013-11-10 Sun 18:03]--[2013-11-10 Sun 18:31] =>  0:28
   - State "DONE"       from "TODO"       [2013-11-09 Sat 19:21]
   CLOCK: [2013-11-09 Sat 19:21]--[2013-11-09 Sat 19:21] =>  0:00
   CLOCK: [2013-11-09 Sat 17:49]--[2013-11-09 Sat 18:19] =>  0:30
   - State "DONE"       from "TODO"       [2013-11-08 Fri 19:55]
   CLOCK: [2013-11-08 Fri 18:12]--[2013-11-08 Fri 19:55] =>  1:43
   - State "DONE"       from "TODO"       [2013-11-07 Thu 17:57]
   CLOCK: [2013-11-07 Thu 17:26]--[2013-11-07 Thu 17:57] =>  0:31
   - State "DONE"       from "TODO"       [2013-11-06 Wed 17:53]
   CLOCK: [2013-11-06 Wed 17:43]--[2013-11-06 Wed 17:53] =>  0:10
   - State "DONE"       from "TODO"       [2013-11-05 Tue 18:06]
   CLOCK: [2013-11-05 Tue 17:39]--[2013-11-05 Tue 18:06] =>  0:27
   - State "DONE"       from "TODO"       [2013-11-04 Mon 18:58]
   CLOCK: [2013-11-04 Mon 18:34]--[2013-11-04 Mon 18:58] =>  0:24
   - State "DONE"       from "TODO"       [2013-11-01 Fri 18:08]
   CLOCK: [2013-11-01 Fri 17:14]--[2013-11-01 Fri 18:08] =>  0:54
   - State "DONE"       from "TODO"       [2013-10-31 Thu 18:02]
   CLOCK: [2013-10-31 Thu 17:39]--[2013-10-31 Thu 18:02] =>  0:23
   - State "DONE"       from "TODO"       [2013-10-29 Tue 18:31]
   CLOCK: [2013-10-29 Tue 18:09]--[2013-10-29 Tue 18:31] =>  0:22
   - State "DONE"       from "TODO"       [2013-10-28 Mon 18:34]
   CLOCK: [2013-10-28 Mon 18:13]--[2013-10-28 Mon 18:34] =>  0:21
   - State "DONE"       from "TODO"       [2013-10-27 Sun 18:30]
   CLOCK: [2013-10-27 Sun 18:09]--[2013-10-27 Sun 18:30] =>  0:21
   - State "DONE"       from "TODO"       [2013-10-26 Sat 18:00]
   CLOCK: [2013-10-26 Sat 17:33]--[2013-10-26 Sat 18:00] =>  0:27
   - State "DONE"       from "TODO"       [2013-10-23 Wed 18:24]
   CLOCK: [2013-10-23 Wed 17:55]--[2013-10-23 Wed 18:24] =>  0:29
   - State "DONE"       from "TODO"       [2013-10-22 Tue 18:09]
   CLOCK: [2013-10-22 Tue 17:45]--[2013-10-22 Tue 18:09] =>  0:24
   - State "DONE"       from "TODO"       [2013-10-21 Mon 18:08]
   CLOCK: [2013-10-21 Mon 17:45]--[2013-10-21 Mon 18:08] =>  0:23
   - State "DONE"       from "TODO"       [2013-10-19 Sat 18:07]
   CLOCK: [2013-10-19 Sat 17:38]--[2013-10-19 Sat 18:07] =>  0:29
   - State "DONE"       from "TODO"       [2013-10-18 Fri 17:37]
   CLOCK: [2013-10-18 Fri 17:11]--[2013-10-18 Fri 17:37] =>  0:26
   - State "DONE"       from "TODO"       [2013-10-17 Thu 18:02]
   CLOCK: [2013-10-17 Thu 17:27]--[2013-10-17 Thu 18:02] =>  0:35
   - State "DONE"       from "TODO"       [2013-10-16 Wed 17:56]
   CLOCK: [2013-10-16 Wed 17:31]--[2013-10-16 Wed 17:56] =>  0:25
   - State "DONE"       from "TODO"       [2013-10-15 Tue 18:22]
   CLOCK: [2013-10-15 Tue 17:59]--[2013-10-15 Tue 18:22] =>  0:23
   - State "DONE"       from "TODO"       [2013-10-14 Mon 18:52]
   CLOCK: [2013-10-14 Mon 18:27]--[2013-10-14 Mon 18:52] =>  0:25
   - State "DONE"       from "TODO"       [2013-10-13 Sun 18:22]
   CLOCK: [2013-10-13 Sun 17:59]--[2013-10-13 Sun 18:22] =>  0:23
   - State "DONE"       from "TODO"       [2013-10-12 Sat 18:30]
   CLOCK: [2013-10-12 Sat 18:08]--[2013-10-12 Sat 18:30] =>  0:22
   - State "DONE"       from "TODO"       [2013-10-10 Thu 18:26]
   CLOCK: [2013-10-10 Thu 18:07]--[2013-10-10 Thu 18:26] =>  0:19
   - State "DONE"       from "TODO"       [2013-10-09 Wed 18:23]
   CLOCK: [2013-10-09 Wed 17:59]--[2013-10-09 Wed 18:23] =>  0:24
   - State "DONE"       from "TODO"       [2013-10-08 Tue 18:08]
   CLOCK: [2013-10-08 Tue 17:45]--[2013-10-08 Tue 18:08] =>  0:23
   - State "DONE"       from "TODO"       [2013-10-07 Mon 18:58]
   CLOCK: [2013-10-07 Mon 18:26]--[2013-10-07 Mon 18:58] =>  0:32
   - State "DONE"       from "TODO"       [2013-10-06 Sun 18:59]
   CLOCK: [2013-10-06 Sun 18:31]--[2013-10-06 Sun 18:59] =>  0:28
   - State "DONE"       from "TODO"       [2013-10-05 Sat 18:23]
   CLOCK: [2013-10-05 Sat 17:58]--[2013-10-05 Sat 18:23] =>  0:25
   - State "DONE"       from "TODO"       [2013-10-04 Fri 18:37]
   CLOCK: [2013-10-04 Fri 18:12]--[2013-10-04 Fri 18:37] =>  0:25
   - State "DONE"       from "TODO"       [2013-10-03 Thu 18:06]
   CLOCK: [2013-10-03 Thu 17:43]--[2013-10-03 Thu 18:06] =>  0:23
   - State "DONE"       from "TODO"       [2013-10-01 Tue 18:27]
   CLOCK: [2013-10-01 Tue 18:01]--[2013-10-01 Tue 18:27] =>  0:26
   - State "DONE"       from "TODO"       [2013-09-30 Mon 18:32]
   CLOCK: [2013-09-30 Mon 18:06]--[2013-09-30 Mon 18:32] =>  0:26
   - State "DONE"       from "TODO"       [2013-09-29 Sun 18:27]
   CLOCK: [2013-09-29 Sun 17:53]--[2013-09-29 Sun 18:27] =>  0:34
   - State "DONE"       from "TODO"       [2013-09-27 Fri 18:44]
   CLOCK: [2013-09-27 Fri 18:07]--[2013-09-27 Fri 18:44] =>  0:37
   - State "DONE"       from "TODO"       [2013-09-26 Thu 19:11]
   CLOCK: [2013-09-26 Thu 18:30]--[2013-09-26 Thu 19:11] =>  0:41
   - State "DONE"       from "TODO"       [2013-09-25 Wed 18:03]
   CLOCK: [2013-09-25 Wed 17:31]--[2013-09-25 Wed 18:03] =>  0:32
   - State "DONE"       from "TODO"       [2013-09-24 Tue 20:13]
   CLOCK: [2013-09-24 Tue 18:33]--[2013-09-24 Tue 20:13] =>  1:40
   - State "DONE"       from "TODO"       [2013-09-23 Mon 18:13]
   CLOCK: [2013-09-23 Mon 17:40]--[2013-09-23 Mon 18:13] =>  0:33
   - State "DONE"       from "TODO"       [2013-09-22 Sun 20:27]
   CLOCK: [2013-09-22 Sun 19:26]--[2013-09-22 Sun 20:27] =>  1:01
   - State "DONE"       from "TODO"       [2013-09-21 Sat 18:44]
   CLOCK: [2013-09-21 Sat 18:14]--[2013-09-21 Sat 18:44] =>  0:30
   - State "DONE"       from "TODO"       [2013-09-20 Fri 17:26]
   CLOCK: [2013-09-20 Fri 17:05]--[2013-09-20 Fri 17:26] =>  0:21
   - State "DONE"       from "TODO"       [2013-09-19 Thu 18:55]
   CLOCK: [2013-09-19 Thu 18:27]--[2013-09-19 Thu 18:55] =>  0:28
   - State "DONE"       from "TODO"       [2013-09-18 Wed 18:15]
   CLOCK: [2013-09-18 Wed 17:44]--[2013-09-18 Wed 18:15] =>  0:31
   - State "DONE"       from "TODO"       [2013-09-17 Tue 18:34]
   CLOCK: [2013-09-17 Tue 18:10]--[2013-09-17 Tue 18:34] =>  0:24
   - State "DONE"       from "TODO"       [2013-09-16 Mon 18:53]
   CLOCK: [2013-09-16 Mon 18:22]--[2013-09-16 Mon 18:53] =>  0:31
   - State "DONE"       from "TODO"       [2013-09-15 Sun 18:29]
   CLOCK: [2013-09-15 Sun 17:52]--[2013-09-15 Sun 18:29] =>  0:37
   - State "DONE"       from "TODO"       [2013-09-13 Fri 18:11]
   CLOCK: [2013-09-13 Fri 17:40]--[2013-09-13 Fri 18:11] =>  0:31
   - State "DONE"       from "TODO"       [2013-09-12 Thu 18:11]
   CLOCK: [2013-09-12 Thu 17:41]--[2013-09-12 Thu 18:11] =>  0:30
   - State "DONE"       from "TODO"       [2013-09-11 Wed 18:04]
   CLOCK: [2013-09-11 Wed 17:39]--[2013-09-11 Wed 18:04] =>  0:25
   - State "DONE"       from "TODO"       [2013-09-10 Tue 18:00]
   CLOCK: [2013-09-10 Tue 17:34]--[2013-09-10 Tue 18:00] =>  0:26
   - State "DONE"       from "TODO"       [2013-09-09 Mon 18:15]
   CLOCK: [2013-09-09 Mon 17:49]--[2013-09-09 Mon 18:15] =>  0:26
   - State "DONE"       from "TODO"       [2013-09-08 Sun 18:50]
   CLOCK: [2013-09-08 Sun 18:25]--[2013-09-08 Sun 18:50] =>  0:25
   - State "DONE"       from "TODO"       [2013-09-07 Sat 18:20]
   CLOCK: [2013-09-07 Sat 17:53]--[2013-09-07 Sat 18:20] =>  0:27
   - State "DONE"       from "TODO"       [2013-09-06 Fri 18:42]
   CLOCK: [2013-09-06 Fri 18:09]--[2013-09-06 Fri 18:42] =>  0:33
   - State "DONE"       from "TODO"       [2013-09-05 Thu 18:09]
   CLOCK: [2013-09-05 Thu 17:44]--[2013-09-05 Thu 18:09] =>  0:25
   - State "DONE"       from "TODO"       [2013-09-04 Wed 18:24]
   CLOCK: [2013-09-04 Wed 17:55]--[2013-09-04 Wed 18:24] =>  0:29
   - State "DONE"       from "TODO"       [2013-09-03 Tue 18:19]
   CLOCK: [2013-09-03 Tue 17:53]--[2013-09-03 Tue 18:19] =>  0:26
   - State "DONE"       from "TODO"       [2013-09-02 Mon 18:41]
   CLOCK: [2013-09-02 Mon 18:11]--[2013-09-02 Mon 18:41] =>  0:30
   - State "DONE"       from "TODO"       [2013-08-31 Sat 18:24]
   CLOCK: [2013-08-31 Sat 17:55]--[2013-08-31 Sat 18:24] =>  0:29
   - State "DONE"       from "TODO"       [2013-08-30 Fri 17:59]
   CLOCK: [2013-08-30 Fri 17:30]--[2013-08-30 Fri 17:59] =>  0:29
   - State "DONE"       from "TODO"       [2013-08-29 Thu 18:11]
   CLOCK: [2013-08-29 Thu 17:42]--[2013-08-29 Thu 18:11] =>  0:29
   - State "DONE"       from "TODO"       [2013-08-28 Wed 18:13]
   CLOCK: [2013-08-28 Wed 17:43]--[2013-08-28 Wed 18:13] =>  0:30
   - State "DONE"       from "TODO"       [2013-08-27 Tue 18:52]
   CLOCK: [2013-08-27 Tue 18:22]--[2013-08-27 Tue 18:52] =>  0:30
   - State "DONE"       from "TODO"       [2013-08-26 Mon 18:13]
   CLOCK: [2013-08-26 Mon 17:42]--[2013-08-26 Mon 18:13] =>  0:31
   - State "DONE"       from "TODO"       [2013-08-25 Sun 18:07]
   CLOCK: [2013-08-25 Sun 17:34]--[2013-08-25 Sun 18:07] =>  0:33
   - State "DONE"       from "TODO"       [2013-08-24 Sat 18:13]
   CLOCK: [2013-08-24 Sat 17:40]--[2013-08-24 Sat 18:13] =>  0:33
   - State "DONE"       from "TODO"       [2013-08-23 Fri 17:41]
   CLOCK: [2013-08-23 Fri 17:11]--[2013-08-23 Fri 17:41] =>  0:30
   - State "DONE"       from "TODO"       [2013-08-21 Wed 17:53]
   CLOCK: [2013-08-21 Wed 17:52]--[2013-08-21 Wed 17:53] =>  0:01
   CLOCK: [2013-08-21 Wed 17:14]--[2013-08-21 Wed 17:44] =>  0:30
   - State "DONE"       from "TODO"       [2013-08-20 Tue 17:42]
   CLOCK: [2013-08-20 Tue 17:10]--[2013-08-20 Tue 17:42] =>  0:32
   - State "DONE"       from "TODO"       [2013-08-19 Mon 17:59]
   CLOCK: [2013-08-19 Mon 17:32]--[2013-08-19 Mon 17:59] =>  0:27
   - State "DONE"       from "TODO"       [2013-08-18 Sun 18:20]
   CLOCK: [2013-08-18 Sun 17:50]--[2013-08-18 Sun 18:20] =>  0:30
   CLOCK: [2013-08-18 Sun 17:29]--[2013-08-18 Sun 17:29] =>  0:00
   - State "DONE"       from "TODO"       [2013-08-17 Sat 17:44]
   CLOCK: [2013-08-17 Sat 17:24]--[2013-08-17 Sat 17:44] =>  0:20
   - State "DONE"       from "TODO"       [2013-08-16 Fri 17:52]
   CLOCK: [2013-08-16 Fri 17:38]--[2013-08-16 Fri 17:52] =>  0:14
   - State "DONE"       from "TODO"       [2013-08-15 Thu 18:01]
   CLOCK: [2013-08-15 Thu 17:37]--[2013-08-15 Thu 18:01] =>  0:24
   - State "DONE"       from "TODO"       [2013-08-14 Wed 18:14]
   CLOCK: [2013-08-14 Wed 17:40]--[2013-08-14 Wed 18:14] =>  0:34
   - State "DONE"       from "TODO"       [2013-08-13 Tue 18:04]
   CLOCK: [2013-08-13 Tue 17:31]--[2013-08-13 Tue 18:04] =>  0:33
   - State "DONE"       from "TODO"       [2013-08-12 Mon 17:57]
   CLOCK: [2013-08-12 Mon 17:20]--[2013-08-12 Mon 17:57] =>  0:37
   - State "DONE"       from "TODO"       [2013-08-11 Sun 17:54]
   CLOCK: [2013-08-11 Sun 17:23]--[2013-08-11 Sun 17:54] =>  0:31
   - State "DONE"       from "TODO"       [2013-08-10 Sat 19:21]
   CLOCK: [2013-08-10 Sat 17:10]--[2013-08-10 Sat 19:21] =>  2:11
   - State "DONE"       from "TODO"       [2013-08-09 Fri 17:54]
   CLOCK: [2013-08-09 Fri 17:20]--[2013-08-09 Fri 17:54] =>  0:34
   - State "DONE"       from "TODO"       [2013-08-08 Thu 18:23]
   CLOCK: [2013-08-08 Thu 17:47]--[2013-08-08 Thu 18:23] =>  0:36
   - State "DONE"       from "TODO"       [2013-08-07 Wed 20:42]
   CLOCK: [2013-08-07 Wed 20:16]--[2013-08-07 Wed 20:42] =>  0:26
   - State "DONE"       from "TODO"       [2013-08-06 Tue 17:47]
   CLOCK: [2013-08-06 Tue 17:12]--[2013-08-06 Tue 17:47] =>  0:35
   - State "DONE"       from "TODO"       [2013-08-02 Fri 23:11]
   CLOCK: [2013-08-02 Fri 22:49]--[2013-08-02 Fri 23:11] =>  0:22
   - State "DONE"       from "TODO"       [2013-07-31 Wed 22:18]
   CLOCK: [2013-07-31 Wed 21:58]--[2013-07-31 Wed 22:18] =>  0:20
   - State "DONE"       from "TODO"       [2013-07-26 Fri 16:44]
   CLOCK: [2013-07-26 Fri 16:32]--[2013-07-26 Fri 16:44] =>  0:12
   - State "DONE"       from "TODO"       [2013-07-12 Fri 17:48]
   CLOCK: [2013-07-12 Fri 17:35]--[2013-07-12 Fri 17:48] =>  0:13
   - State "DONE"       from "TODO"       [2013-07-06 Sat 15:51]
   CLOCK: [2013-07-06 Sat 15:40]--[2013-07-06 Sat 15:51] =>  0:11
   - State "DONE"       from "TODO"       [2013-07-04 Thu 16:12]
   CLOCK: [2013-07-04 Thu 15:49]--[2013-07-04 Thu 16:12] =>  0:23
   - State "DONE"       from "TODO"       [2013-06-24 Mon 22:19]
   CLOCK: [2013-06-24 Mon 22:02]--[2013-06-24 Mon 22:19] =>  0:17
   - State "DONE"       from "TODO"       [2013-06-19 Wed 23:13]
   - State "DONE"       from "TODO"       [2013-05-15 Wed 23:46]
   CLOCK: [2013-05-15 Wed 23:30]--[2013-05-15 Wed 23:46] =>  0:16
   - State "DONE"       from "TODO"       [2013-05-01 Wed 20:36]
   CLOCK: [2013-05-01 Wed 20:24]--[2013-05-01 Wed 20:36] =>  0:12
   - State "DONE"       from "TODO"       [2013-04-16 Tue 23:19]
   CLOCK: [2013-04-16 Tue 22:53]--[2013-04-16 Tue 23:19] =>  0:26
   - State "DONE"       from "TODO"       [2013-04-08 Mon 23:50]
   CLOCK: [2013-04-08 Mon 23:23]--[2013-04-08 Mon 23:50] =>  0:27
   - State "DONE"       from "TODO"       [2013-03-29 Fri 23:20]
   CLOCK: [2013-03-29 Fri 23:04]--[2013-03-29 Fri 23:20] =>  0:16
   - State "DONE"       from "TODO"       [2013-03-23 Sat 23:40]
   CLOCK: [2013-03-23 Sat 23:24]--[2013-03-23 Sat 23:40] =>  0:16
   - State "DONE"       from "TODO"       [2013-03-18 Mon 23:32]
   CLOCK: [2013-03-18 Mon 23:14]--[2013-03-18 Mon 23:32] =>  0:18
   - State "DONE"       from "TODO"       [2013-03-12 Tue 23:11]
   CLOCK: [2013-03-12 Tue 22:58]--[2013-03-12 Tue 23:10] =>  0:12
   CLOCK: [2013-03-09 Sat 22:41]--[2013-03-09 Sat 22:54] =>  0:13
   - State "DONE"       from "TODO"       [2013-03-04 Mon 23:11]
   CLOCK: [2013-03-04 Mon 22:51]--[2013-03-04 Mon 23:11] =>  0:20
   - State "DONE"       from "TODO"       [2013-02-26 Tue 23:20]
   CLOCK: [2013-02-26 Tue 23:08]--[2013-02-26 Tue 23:20] =>  0:12
   - State "DONE"       from "TODO"       [2013-02-21 Thu 23:53]
   CLOCK: [2013-02-21 Thu 23:41]--[2013-02-21 Thu 23:53] =>  0:12
   - State "DONE"       from "TODO"       [2013-02-16 Sat 22:41]
   CLOCK: [2013-02-16 Sat 22:25]--[2013-02-16 Sat 22:41] =>  0:16
   - State "DONE"       from "TODO"       [2013-02-13 Wed 22:56]
   CLOCK: [2013-02-13 Wed 22:25]--[2013-02-13 Wed 22:56] =>  0:31
   CLOCK: [2013-02-11 Mon 22:36]--[2013-02-11 Mon 22:51] =>  0:15
   - State "DONE"       from "TODO"       [2013-02-09 Sat 22:58]
   CLOCK: [2013-02-09 Sat 22:35]--[2013-02-09 Sat 22:58] =>  0:23
   - State "DONE"       from "TODO"       [2013-02-03 Sun 23:03]
   CLOCK: [2013-02-03 Sun 22:35]--[2013-02-03 Sun 23:03] =>  0:28
   - State "DONE"       from "TODO"       [2013-01-28 Mon 22:34]
   CLOCK: [2013-01-28 Mon 22:15]--[2013-01-28 Mon 22:34] =>  0:19
   - State "DONE"       from "TODO"       [2013-01-27 Sun 23:17]
   CLOCK: [2013-01-27 Sun 22:50]--[2013-01-27 Sun 23:17] =>  0:27
   - State "DONE"       from "TODO"       [2013-01-23 Wed 22:50]
   CLOCK: [2013-01-23 Wed 22:38]--[2013-01-23 Wed 22:50] =>  0:12
   - State "DONE"       from "TODO"       [2013-01-21 Mon 22:58]
   CLOCK: [2013-01-21 Mon 22:39]--[2013-01-21 Mon 22:58] =>  0:19
   - State "DONE"       from "TODO"       [2013-01-16 Wed 22:10]
   CLOCK: [2013-01-16 Wed 21:50]--[2013-01-16 Wed 22:10] =>  0:20
   - State "DONE"       from "TODO"       [2012-12-28 Fri 22:22]
   CLOCK: [2012-12-28 Fri 22:10]--[2012-12-28 Fri 22:22] =>  0:12
   - State "DONE"       from "TODO"       [2012-12-26 Wed 22:24]
   CLOCK: [2012-12-26 Wed 22:11]--[2012-12-26 Wed 22:24] =>  0:13
   - State "DONE"       from "TODO"       [2012-12-22 Sat 22:33]
   CLOCK: [2012-12-22 Sat 22:13]--[2012-12-22 Sat 22:33] =>  0:20
   - State "DONE"       from "TODO"       [2012-12-18 Tue 22:29]
   CLOCK: [2012-12-18 Tue 22:10]--[2012-12-18 Tue 22:29] =>  0:19
   - State "DONE"       from "TODO"       [2012-12-16 Sun 22:03]
   CLOCK: [2012-12-16 Sun 21:39]--[2012-12-16 Sun 22:03] =>  0:24
- State "DONE"       from "TODO"       [2012-12-14 Fri 22:50]
   CLOCK: [2012-12-14 Fri 22:43]--[2012-12-14 Fri 22:50] =>  0:07
- State "DONE"       from "TODO"       [2012-12-10 Mon 22:07]
   CLOCK: [2012-12-10 Mon 21:45]--[2012-12-10 Mon 22:07] =>  0:22
- State "DONE"       from "TODO"       [2012-12-08 Sat 22:42]
   CLOCK: [2012-12-08 Sat 22:21]--[2012-12-08 Sat 22:42] =>  0:21
- State "DONE"       from "TODO"       [2012-12-06 Thu 22:26]
   CLOCK: [2012-12-06 Thu 22:12]--[2012-12-06 Thu 22:26] =>  0:14
   CLOCK: [2012-12-06 Thu 22:09]--[2012-12-06 Thu 22:10] =>  0:01
- State "DONE"       from "TODO"       [2012-12-05 Wed 22:29]
   CLOCK: [2012-12-05 Wed 22:14]--[2012-12-05 Wed 22:29] =>  0:15
- State "DONE"       from "TODO"       [2012-12-02 Sun 21:47]
   CLOCK: [2012-12-02 Sun 21:30]--[2012-12-02 Sun 21:47] =>  0:17
- State "DONE"       from "TODO"       [2012-11-28 Wed 21:46]
   CLOCK: [2012-11-28 Wed 21:22]--[2012-11-28 Wed 21:46] =>  0:24
- State "DONE"       from "TODO"       [2012-11-24 Sat 21:51]
   CLOCK: [2012-11-24 Sat 21:31]--[2012-11-24 Sat 21:51] =>  0:20
- State "DONE"       from "TODO"       [2012-11-22 Thu 22:12]
   CLOCK: [2012-11-22 Thu 21:48]--[2012-11-22 Thu 22:12] =>  0:24
   CLOCK: [2012-11-22 Thu 13:04]--[2012-11-22 Thu 13:04] =>  0:00
- State "DONE"       from "TODO"       [2012-11-19 Mon 22:11]
   CLOCK: [2012-11-19 Mon 21:47]--[2012-11-19 Mon 22:11] =>  0:24
- State "DONE"       from "TODO"       [2012-11-17 Sat 22:07]
   CLOCK: [2012-11-17 Sat 21:40]--[2012-11-17 Sat 22:07] =>  0:27
- State "DONE"       from "TODO"       [2012-11-13 Tue 22:24]
   CLOCK: [2012-11-13 Tue 21:42]--[2012-11-13 Tue 22:23] =>  0:41
- State "DONE"       from "TODO"       [2012-11-12 Mon 23:02]
   CLOCK: [2012-11-12 Mon 22:37]--[2012-11-12 Mon 23:02] =>  0:25
- State "DONE"       from "TODO"       [2012-11-11 Sun 22:03]
   CLOCK: [2012-11-11 Sun 21:36]--[2012-11-11 Sun 22:03] =>  0:27
- State "DONE"       from "TODO"       [2012-11-08 Thu 22:54]
   CLOCK: [2012-11-08 Thu 22:29]--[2012-11-08 Thu 22:54] =>  0:25
- State "DONE"       from "TODO"       [2012-11-06 Tue 22:48]
   CLOCK: [2012-11-06 Tue 22:26]--[2012-11-06 Tue 22:48] =>  0:22
- State "DONE"       from "TODO"       [2012-11-04 Sun 22:50]
   CLOCK: [2012-11-04 Sun 22:31]--[2012-11-04 Sun 22:50] =>  0:19
- State "DONE"       from "TODO"       [2012-11-02 Fri 21:57]
   CLOCK: [2012-11-02 Fri 21:17]--[2012-11-02 Fri 21:57] =>  0:40
- State "DONE"       from "TODO"       [2012-10-30 Tue 23:06]
   CLOCK: [2012-10-30 Tue 22:49]--[2012-10-30 Tue 23:06] =>  0:17
- State "DONE"       from "TODO"       [2012-10-27 Sat 22:25]
   CLOCK: [2012-10-27 Sat 22:04]--[2012-10-27 Sat 22:25] =>  0:21
- State "DONE"       from "TODO"       [2012-10-21 Sun 22:17]
   CLOCK: [2012-10-21 Sun 22:01]--[2012-10-21 Sun 22:17] =>  0:16
- State "DONE"       from "TODO"       [2012-10-19 Fri 22:40]
   CLOCK: [2012-10-19 Fri 22:12]--[2012-10-19 Fri 22:40] =>  0:28
- State "DONE"       from "TODO"       [2012-10-18 Thu 23:05]
   CLOCK: [2012-10-18 Thu 22:27]--[2012-10-18 Thu 23:04] =>  0:37
- State "DONE"       from "TODO"       [2012-10-16 Tue 23:33]
   CLOCK: [2012-10-16 Tue 23:07]--[2012-10-16 Tue 23:33] =>  0:26
   CLOCK: [2012-10-13 Sat 21:10]--[2012-10-13 Sat 21:42] =>  0:32
- State "DONE"       from "TODO"       [2012-10-11 Thu 21:52]
   CLOCK: [2012-10-11 Thu 21:34]--[2012-10-11 Thu 21:52] =>  0:18
- State "DONE"       from "TODO"       [2012-10-10 Wed 22:05]
   CLOCK: [2012-10-10 Wed 21:49]--[2012-10-10 Wed 22:05] =>  0:16
- State "DONE"       from "TODO"       [2012-10-07 Sun 22:19]
   CLOCK: [2012-10-07 Sun 22:05]--[2012-10-07 Sun 22:19] =>  0:14
- State "DONE"       from "TODO"       [2012-10-03 Wed 21:31]
   CLOCK: [2012-10-03 Wed 21:15]--[2012-10-03 Wed 21:31] =>  0:16
- State "DONE"       from "TODO"       [2012-10-01 Mon 22:57]
   CLOCK: [2012-10-01 Mon 22:41]--[2012-10-01 Mon 22:57] =>  0:16
- State "DONE"       from "NEXT"       [2012-09-30 Sun 23:55]
   CLOCK: [2012-09-30 Sun 23:42]--[2012-09-30 Sun 23:55] =>  0:13
- State "DONE"       from "TODO"       [2012-09-28 Fri 22:57]
   CLOCK: [2012-09-28 Fri 22:39]--[2012-09-28 Fri 22:56] =>  0:17
- State "DONE"       from "TODO"       [2012-09-26 Wed 23:18]
   CLOCK: [2012-09-26 Wed 23:03]--[2012-09-26 Wed 23:17] =>  0:14
   CLOCK: [2012-09-25 Tue 20:56]--[2012-09-25 Tue 21:10] =>  0:14
   :END:
   :PROPERTIES:
   :Effort:   0:30
   :LAST_REPEAT: [2014-01-13 Mon 19:15]
   :STYLE:    habit
   :END:
   SCHEDULED: <2014-01-14 Tue .+1d>

*** TODO OJ
    SCHEDULED: <2013-08-31 Sat +1d>
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2013-09-04 Wed 22:09]
    - State "DONE"       from "TODO"       [2013-09-01 Sun 00:21]
    - State "DONE"       from "TODO"       [2013-08-31 Sat 00:31]
    - State "DONE"       from "TODO"       [2013-08-29 Thu 16:33]
    - State "DONE"       from "TODO"       [2013-08-27 Tue 19:10]
    - State "DONE"       from "TODO"       [2013-08-25 Sun 17:33]
    - State "DONE"       from "TODO"       [2013-08-24 Sat 14:42]
    - State "DONE"       from "TODO"       [2013-08-23 Fri 14:47]
    - State "DONE"       from "TODO"       [2013-08-21 Wed 11:07]
    - State "DONE"       from "TODO"       [2013-08-15 Thu 21:26]
    :END:
    :PROPERTIES:
    :STYLE:    habit
    :LAST_REPEAT: [2013-09-04 Wed 22:09]
    :END:

*** TODO Dota Video
    SCHEDULED: <2014-01-12 Sun .+1d>
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2014-01-11 Sat 18:08]
    - State "DONE"       from "TODO"       [2014-01-08 Wed 17:16]
    - State "DONE"       from "TODO"       [2014-01-06 Mon 21:30]
    - State "DONE"       from "TODO"       [2014-01-05 Sun 18:05]
    - State "DONE"       from "TODO"       [2014-01-04 Sat 17:22]
    - State "DONE"       from "TODO"       [2014-01-02 Thu 21:00]
    - State "DONE"       from "TODO"       [2014-01-01 Wed 17:43]
    - State "DONE"       from "TODO"       [2013-12-30 Mon 17:17]
    - State "DONE"       from "TODO"       [2013-12-28 Sat 18:32]
    - State "DONE"       from "TODO"       [2013-12-27 Fri 18:00]
    - State "DONE"       from "TODO"       [2013-12-26 Thu 18:30]
    - State "DONE"       from "TODO"       [2013-12-25 Wed 18:56]
    - State "DONE"       from "TODO"       [2013-12-23 Mon 17:01]
    - State "DONE"       from "TODO"       [2013-12-18 Wed 22:11]
    - State "DONE"       from "TODO"       [2013-11-27 Wed 18:43]
    - State "DONE"       from "TODO"       [2013-11-26 Tue 18:00]
    - State "DONE"       from "TODO"       [2013-11-25 Mon 18:29]
    - State "DONE"       from "TODO"       [2013-11-24 Sun 15:16]
    - State "DONE"       from "TODO"       [2013-11-23 Sat 18:37]
    - State "DONE"       from "TODO"       [2013-11-21 Thu 18:14]
    - State "DONE"       from "TODO"       [2013-11-20 Wed 17:42]
    - State "DONE"       from "TODO"       [2013-11-19 Tue 12:39]
    - State "DONE"       from "TODO"       [2013-11-18 Mon 18:20]
    - State "DONE"       from "TODO"       [2013-11-17 Sun 17:25]
    - State "DONE"       from "TODO"       [2013-11-16 Sat 17:56]
    - State "DONE"       from "TODO"       [2013-11-14 Thu 18:08]
    - State "DONE"       from "TODO"       [2013-11-13 Wed 17:36]
    - State "DONE"       from "TODO"       [2013-11-10 Sun 18:02]
    - State "DONE"       from "TODO"       [2013-11-09 Sat 17:49]
    - State "DONE"       from "TODO"       [2013-11-08 Fri 18:12]
    - State "DONE"       from "TODO"       [2013-11-07 Thu 17:26]
    - State "DONE"       from "TODO"       [2013-11-06 Wed 17:43]
    - State "DONE"       from "TODO"       [2013-11-05 Tue 17:39]
    - State "DONE"       from "TODO"       [2013-10-31 Thu 17:38]
    - State "DONE"       from "TODO"       [2013-10-29 Tue 18:09]
    - State "DONE"       from "TODO"       [2013-10-28 Mon 18:13]
    - State "DONE"       from "TODO"       [2013-10-27 Sun 18:30]
    - State "DONE"       from "TODO"       [2013-10-26 Sat 18:00]
    - State "DONE"       from "TODO"       [2013-10-23 Wed 17:55]
    - State "DONE"       from "TODO"       [2013-10-22 Tue 17:45]
    - State "DONE"       from "TODO"       [2013-10-21 Mon 21:40]
    - State "DONE"       from "TODO"       [2013-10-06 Sun 18:31]
    - State "DONE"       from "TODO"       [2013-10-05 Sat 20:50]
    - State "DONE"       from "TODO"       [2013-10-03 Thu 17:42]
    - State "DONE"       from "TODO"       [2013-10-02 Wed 16:51]
    - State "DONE"       from "TODO"       [2013-10-01 Tue 18:01]
    - State "DONE"       from "TODO"       [2013-09-25 Wed 19:24]
    - State "DONE"       from "TODO"       [2013-09-24 Tue 23:07]
    - State "DONE"       from "TODO"       [2013-09-22 Sun 19:26]
    - State "DONE"       from "TODO"       [2013-09-21 Sat 09:21]
    - State "DONE"       from "TODO"       [2013-09-10 Tue 17:34]
    - State "DONE"       from "TODO"       [2013-09-09 Mon 17:49]
    - State "DONE"       from "TODO"       [2013-09-08 Sun 23:07]
    - State "DONE"       from "TODO"       [2013-09-04 Wed 17:55]
    - State "DONE"       from "TODO"       [2013-09-03 Tue 23:22]
    - State "DONE"       from "TODO"       [2013-08-29 Thu 20:48]
    - State "DONE"       from "TODO"       [2013-08-28 Wed 17:36]
    - State "DONE"       from "TODO"       [2013-08-26 Mon 18:13]
    - State "DONE"       from "TODO"       [2013-08-25 Sun 21:18]
    - State "DONE"       from "TODO"       [2013-08-24 Sat 19:31]
    - State "DONE"       from "TODO"       [2013-08-20 Tue 19:44]
    - State "DONE"       from "TODO"       [2013-08-19 Mon 21:05]
    - State "DONE"       from "TODO"       [2013-08-17 Sat 21:15]
    - State "DONE"       from "TODO"       [2013-08-15 Thu 12:32]
    - State "DONE"       from "TODO"       [2013-08-14 Wed 20:26]
    - State "DONE"       from "TODO"       [2013-08-12 Mon 17:20]
    - State "DONE"       from "TODO"       [2013-08-11 Sun 20:10]
    CLOCK: [2013-08-11 Sun 19:30]--[2013-08-11 Sun 20:10] =>  0:40
    - State "DONE"       from "TODO"       [2013-08-07 Wed 16:07]
    - State "DONE"       from "TODO"       [2013-08-06 Tue 19:23]
    CLOCK: [2013-08-06 Tue 18:56]--[2013-08-06 Tue 19:23] =>  0:27
    CLOCK: [2013-08-06 Tue 11:51]--[2013-08-06 Tue 14:13] =>  2:22
    - State "DONE"       from "TODO"       [2013-08-05 Mon 23:14]
    CLOCK: [2013-08-05 Mon 19:07]--[2013-08-05 Mon 19:43] =>  0:36
    - State "DONE"       from "TODO"       [2013-08-04 Sun 23:04]
    CLOCK: [2013-08-04 Sun 21:58]--[2013-08-04 Sun 23:04] =>  1:06
    :END:
    :PROPERTIES:
    :STYLE:    habit
    :LAST_REPEAT: [2014-01-11 Sat 18:08]
    :END:

*** TODO Capital Journey
    DEADLINE: <2014-02-12 Wed +1m>
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2014-01-03 Fri 09:39]
    - State "DONE"       from "TODO"       [2013-12-17 Tue 14:23]
    :END:
    :PROPERTIES:
    :STYLE:    habit
    :LAST_REPEAT: [2014-01-03 Fri 09:39]
    :END:

*** TODO Discover Card
    DEADLINE: <2014-02-04 Tue +1m>
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2014-01-03 Fri 09:39]
    - State "DONE"       from "TODO"       [2013-12-17 Tue 14:23]
    - State "DONE"       from "TODO"       [2013-11-17 Sun 09:54]
    :END:
    :PROPERTIES:
    :STYLE:    habit
    :LAST_REPEAT: [2014-01-03 Fri 09:39]
    :END:


* Anniversaries
  :PROPERTIES:
  :CATEGORY: Anniv
  :END:
%%(org-bbdb-anniversaries)
